//!============================================================
//!
//!  @file    : Audio.h
//!  @brief   : オーディオクラスのヘッダーファイル
//!  @author  : 学校配布のファイル
//!  @details : オーディオ（サウンド）の簡易実装
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include <xaudio2.h>


//!===========================================================
//! @class Audio
//! @brief   : オーディオ実装のクラス
//!===========================================================
class Audio
{
public:

	//!-------------------------------------------------------
	//! @fn      : InitMaster()
	//! @brief   : マスタの初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : COMの初期化
	//!            XAudioの生成
	//!            マスタリングボイスの生成
	//!-------------------------------------------------------
	static void InitMaster();

	//!-------------------------------------------------------
	//! @fn      : UninitMaster()
	//! @brief   : マスタの初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : マスタリングボイスの解放
	//!            XAudioの解放
	//!            COMの終了処理
	//!-------------------------------------------------------
	static void UninitMaster();

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Init() {};

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シーンの終了処理など
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Update() {};

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Draw() {};

	//!-------------------------------------------------------
	//! @fn      : Load(const char *audioFileName)
	//! @brief   : オーディオデータのロードをする
	//! @param   : audioFileName...ロードしたいファイル名
	//! @return  : なし
	//! @details : サウンドデータの読み込み
	//!            サウンドソースの生成
	//!-------------------------------------------------------
	void Load(const char *audioFileName);

	//!-------------------------------------------------------
	//! @fn      : Play(bool loop = false)
	//! @brief   : サウンドの再生
	//! @param   : loop...ループ再生をするかどうか
	//! @return  : なし
	//! @details : サウンドの再生を実装
	//!            バッファを設定し再生する
	//!            Loop が true ならループ再生する（初期値は false ）
	//!-------------------------------------------------------
	void Play(bool loop = false);

	//!-------------------------------------------------------
	//! @fn      : Stop()
	//! @brief   : サウンドの停止
	//! @param   : なし
	//! @return  : なし
	//! @details : サウンドの停止を実装
	//!-------------------------------------------------------
	void Stop();

private:

	//! XAudio
	static IXAudio2* audioXAudio;

	//! マスタリングボイス
	static IXAudio2MasteringVoice*	masteringVoice;

	//! 音源
	IXAudio2SourceVoice* sourceVoice;

	//! サウンドデータ
	BYTE* soundData;

	//! オーディオのバイトデータ
	int length;

	//! 再生する長さ
	int	playLength;

};
