//!============================================================
//!
//!  @file    : Block.h
//!  @brief   : ブロッククラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : ブロックの実装
//!             ゲームオブジェクトクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "GameObject.h"


//!===========================================================
//! @class Block
//! @brief   : ブロック実装のクラス
//!===========================================================
class Block : public GameObject
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 初期化処理
	//!            モデルの生成
	//!            シェーダーの設定
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シェーダーの設定
	//!            マトリクスの設定
	//!            モデルの描画
	//!-------------------------------------------------------
	void Draw();

	//!-------------------------------------------------------
	//! @fn      : SetIsDraw(bool setIsDraw)
	//! @brief   : 描画をするか銅貨を変更
	//! @param   : setIsDraw...trueまたはfalse
	//! @return  : なし
	//! @details : 引数が true なら描画を有効
	//!                   false なら描画を無効   
	//!-------------------------------------------------------
	void SetIsDraw(bool setIsDraw);

private:

	//! モデルデータを格納
	static Model* model;

	//! 描画の有効化
	bool isDraw;
};