//!============================================================
//!
//!  @file    : DungeonMap.h
//!  @brief   : ダンジョンマップ生成クラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : ダンジョンマップ生成の実装
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "DungeonMapData.h"
#include "GameObject.h"


//!===========================================================
//! @class DungeonMap
//! @brief   : ダンジョンマップ生成実装のクラス
//!===========================================================
class DungeonMap : public GameObject
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 初期化処理
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Draw();

	//!-------------------------------------------------------
	//! @fn      : SetBlock()
	//! @brief   : ブロックの配置
	//! @param   : なし
	//! @return  : なし
	//! @details : 
	//!-------------------------------------------------------
	void SetBlock();

	//!-------------------------------------------------------
	//! @fn         : GetCenterPosition(int xNumber, int zNumber) const
	//! @brief      : 中心座標の取得
	//! @param arg1 : xNumber...取得したい中心座標のX（横）番号
	//! @param arg2 : zNumber...取得したい中心座標のZ（縦）番号
	//! @return     : xNumberとzNumberに対応した中心座標
	//! @details    : xNumberとzNumberに対応した中心座標のを返す
	//!-------------------------------------------------------
	D3DXVECTOR3 GetCenterPosition(int xNumber, int zNumber) const;

	//!-------------------------------------------------------
    //! @fn         : IsMapDataMove(int xNumber, int zNumber) const
    //! @brief      : 進むことができるマスかどうかを返す
    //! @param arg1 : xNumber...取得したい中心座標のX（横）番号
    //! @param arg2 : zNumber...取得したい中心座標のZ（縦）番号
    //! @return     : 進むことができるマスかどうか
    //! @details    : xNumberとzNumberに対応したマップ情報が
    //!               壁の場合はfalseを返す
    //!-------------------------------------------------------
	bool IsMapDataMove(int xNumber, int zNumber);
 

	//!-------------------------------------------------------
	//! @fn      : SetGameClear()
	//! @brief   : ゲームクリア画面のセット
	//! @param   : なし
	//! @return  : なし
	//! @details : 
	//!-------------------------------------------------------
	void SetGameClear();

	//!-------------------------------------------------------
	//! @fn      : SetGameOver()
	//! @brief   : ゲームオーバー画面のセット
	//! @param   : なし
	//! @return  : なし
	//! @details : 
	//!-------------------------------------------------------
	void SetGameOver();

private:

	//! ダンジョンのマップ情報
	DungeonMapData dungeonMapData;

};