//!============================================================
//!
//!  @file    : Effect.h
//!  @brief   : エフェクトクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : エフェクト描画実装のクラス
//!             ゲームオブジェクトクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "GameObject.h"


//!===========================================================
//! @class Effect
//! @brief   : エフェクト描画実装のクラス
//!===========================================================
class Effect : public GameObject
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 初期化と頂点バッファ生成やシェーダーの設定
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : frameの更新
	//!            一定のフレーム数を超えたらオブジェクトを消去
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : テクスチャの座標を算出
	//!            入力レイアウト設定、シェーダー設定
	//!            マトリクス設定、頂点バッファ設定
	//!            テクスチャ設定、プリミティブトポロジ設定
	//!            ポリゴン描画、ビルボードの設定
	//!-------------------------------------------------------
	void Draw();

private:

	//! フレーム数
	int frame;
};