//!============================================================
//!
//!  @file    : Fade.h
//!  @brief   : フェードクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : 画面のフェードを行うフェードオブジェクトの実装
//!             ポリゴン2Dクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "Polygon2D.h"


//!===========================================================
//! @class Fade
//! @brief   : フェード実装のクラス
//!===========================================================
class Fade : public Polygon2D
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 頂点データの打ち込み
	//!            テクスチャの読み込み
	//!            シェーダーの設定
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : アルファの値を変化させて
	//!            フェードイン・アウトの実装を行う
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 継承元のDraw関数の呼び出し
	//!-------------------------------------------------------
	void Draw();

	//!-------------------------------------------------------
	//! @fn      : SetFade(int type)
	//! @brief   : フェードのセット
	//! @param   : type.....フェードのタイプ
	//! @return  : なし
	//! @details : 外部的にフェードのセットする際に使用
	//!            画面が白くなる、白い状態から通常の画面になるフェード
	//!            type が1ならフェードイン、2ならフェードアウト
	//!-------------------------------------------------------
	static void SetFade(int type);

	//!-------------------------------------------------------
	//! @fn      : GetFadeType()
	//! @brief   : フェードのタイプの取得
	//! @param   : なし
	//! @return  : type（現在のフェードのタイプ）
	//! @details : 現在のフェードのタイプを取得する
	//!-------------------------------------------------------
	static int GetFadeType();

private:

	//! フェードのタイプ
	static int fadeType;

	//! フェード用のアルファ値
	static float fadeAlpha;

};