//!============================================================
//!
//!  @file    : GameScene.h
//!  @brief   : ゲームシーンクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : ゲームの大まかなものはここで行う
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "Scene.h"


//!===========================================================
//! @class GameScene
//! @brief   : ゲームの制作を行うシーンのクラス
//!===========================================================
class GameScene : public Scene
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : オブジェクトの配置などはここで行う
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シーンの終了処理など
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シーンの更新やキー入力など
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : SetResult(int type)
	//! @brief   : リザルト画面までの設定を行う
	//! @param   : type...リザルトのタイプ
	//!            0ならゲームクリア画面 1ならゲームオーバー画面
	//! @return  : なし
	//! @details : リザルトタイプやフェードの設定を入れる
	//!            Game::SetResult(0)のように使用する
	//!-------------------------------------------------------
	static void SetResult(int type);

private:

	//! フェード中かどうか
	static bool isFade;

	//! リザルトのタイプ
	static int resultType;
};
