//!============================================================
//!
//!  @file    : ResultClearScene.h
//!  @brief   : リザルトクリアシーンクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : ゲームクリア画面の設定はここで行う
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "Scene.h"


//!===========================================================
//! @class ResultClearScene
//! @brief   : ゲームクリア画面のシーンのクラス
//!===========================================================
class ResultClearScene : public Scene
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : オブジェクトの配置などはここで行う
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シーンの終了処理など
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シーンの更新やキー入力など
	//!-------------------------------------------------------
	void Update();

private:

	//! フェード中かどうか
	bool isFade;

};
