//!============================================================
//!
//!  @file    : Sky.h
//!  @brief   : スカイドームクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : スカイドーム実装のクラス
//!             ゲームオブジェクトクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "GameObject.h"


//!===========================================================
//! @class Sky
//! @brief   : スカイドーム実装のクラス
//!===========================================================
class Sky : public GameObject
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 初期化処理
	//!            モデルの生成
	//!            シェーダーの設定
	//!            モデルの内側に画像を張りオブジェクトを大きく見せることで表現
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : シェーダーの設定
	//!            マトリクスの設定
	//!            モデルの描画
	//!-------------------------------------------------------
	void Draw();

private:

	//! モデルを格納
	static Model* model;
};