//!============================================================
//!
//!  @file    : TitleName.h
//!  @brief   : タイトル画面のタイトルクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : タイトル画面のタイトルオブジェクト
//!             ポリゴン2Dクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "Polygon2D.h"


//!===========================================================
//! @class TitleBG
//! @brief   : タイトル画面の背景実装のクラス
//!===========================================================
class TitleName : public Polygon2D
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 変数の初期化
	//!            頂点データの打ち込み
	//!            テクスチャの読み込み
	//!            シェーダーの設定
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 張力、重力、抵抗から加速値を求めて
	//!            その値から座標を更新する
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 継承元のDraw関数の呼び出し
	//!-------------------------------------------------------
	void Draw();

private:

	//! 質量
	float mass;

	//! 間時間
	float deltaTime;

	//! サイズ
	D3DXVECTOR2 size;

	//! 速度
	D3DXVECTOR2 velocity;

	//! 張力
	D3DXVECTOR2 tension;
};