//!============================================================
//!
//!  @file    : TitlePress.h
//!  @brief   : タイトル画面のプレスエンターオブジェクトクラスのヘッダーファイル
//!  @author  : 原田 陽央
//!  @details : タイトル画面のプレスエンターオブジェクト
//!             ポリゴン2Dクラスを継承
//!
//!============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "Polygon2D.h"


//!===========================================================
//! @class TitlePress
//! @brief   : タイトル画面のプレスエンターオブジェクト実装のクラス
//!===========================================================
class TitlePress : public Polygon2D
{
public:

	//!-------------------------------------------------------
	//! @fn      : Init()
	//! @brief   : 初期化をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 頂点データの打ち込み
	//!            テクスチャの読み込み
	//!            シェーダーの設定
	//!-------------------------------------------------------
	void Init();

	//!-------------------------------------------------------
	//! @fn      : Uninit()
	//! @brief   : 終了処理をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Uninit();

	//!-------------------------------------------------------
	//! @fn      : Update()
	//! @brief   : 更新をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 実装内容なし
	//!-------------------------------------------------------
	void Update();

	//!-------------------------------------------------------
	//! @fn      : Draw()
	//! @brief   : 描画をする
	//! @param   : なし
	//! @return  : なし
	//! @details : 継承元のDraw関数の呼び出し
	//!-------------------------------------------------------
	void Draw();

private:

	int frame;
};